# 基于 SQLite 数据库的 shell 历史记录同步与搜索工具
brew 'atuin'
# Java 项目构建和管理工具
brew 'maven'
# 开发环境工具链管理工具（类似 asdf）
brew 'mise'
# Mac App Store 命令行接口
brew 'mas'
# Java 11 开发工具包，并链接到默认路径
brew 'openjdk@11', link: true
# 命令行图像差异查看工具（常用于 git diff）
brew 'spaceman-diff'
# 跨终端的轻量级自定义 prompt 提示符
brew 'starship'
# Zsh 命令行自动补全建议插件
brew 'zsh-autosuggestions'
# Zsh 命令行语法高亮插件
brew 'zsh-syntax-highlighting'
# Mac 系统的深度清理与优化命令行工具
brew 'mole'

# API 文档、调试、Mock、测试一体化协作平台
cask 'apifox'
# 开源密码管理器客户端
cask 'bitwarden'
# 基于 Tauri 的跨平台 Clash 代理客户端
cask 'clash-verge-rev'
# OpenAI Codex 桌面端 AI 编程代理工具
cask 'codex-app'
# 钉钉，企业级办公通讯软件
cask 'dingtalk'
# macOS 网页视频下载工具
cask 'downie'
# 易用的跨平台词典翻译工具
cask 'easydict'
# 飞书，企业协作与管理平台
cask 'feishu'
# JetBrains Mono 编程字体（包含 Nerd 字体图标）
cask 'font-jetbrains-mono-nerd-font'
# 跨平台的高性能终端模拟器
cask 'ghostty'
# 谷歌 Chrome 浏览器
cask 'google-chrome'
# 专为前端和 uni-app 打造的轻量级 IDE
cask 'hbuilderx'
# 适用于 macOS 的现代开源视频播放器
cask 'iina'
# JetBrains 出品的 Java IDE 旗舰版
cask 'intellij-idea'
# JetBrains 出品的数据库管理工具
cask 'datagrip'
# 强大的双链 Markdown 本地知识库笔记软件
cask 'obsidian'
# 简单强大的截图与贴图工具
cask 'snipaste'
# macOS 菜单栏系统状态监控工具
cask 'stats'
# 跨平台的即时通讯软件
cask 'telegram'
# 支持跨平台同步的 SSH 客户端
cask 'termius'
# 滴答清单，待办事项和时间管理应用
cask 'ticktick'
# 字节跳动推出的 AI 编程 IDE (中国版)
cask 'trae-cn'
# 微软开源的跨平台代码编辑器 VS Code
cask 'visual-studio-code'
# 微信开发者工具
cask 'wechatwebdevtools'
# 企业微信，办公沟通工具
cask 'wechatwork'
# WPS Office 办公软件 (中国版)
cask 'wpsoffice-cn'
# 群晖 NAS 云盘同步客户端
cask 'synology-drive'
# 鼠须管 (Rime) 中文输入法 macOS 版本
cask 'squirrel-app'

# 微信 macOS 客户端
mas '微信', id: 836500024
# 百度网盘 macOS 客户端
mas '百度网盘', id: 547166701

# Iconify 图标内联显示与自动补全
vscode "antfu.iconify"
# pnpm catalog 版本号提示插件
vscode "antfu.pnpm-catalog-lens"
# UnoCSS 引擎支持与自动补全
vscode "antfu.unocss"
# 颜色信息预览插件
vscode "bierner.color-info"
# Tailwind CSS 智能提示与补全
vscode "bradlc.vscode-tailwindcss"
# HSL 颜色预览工具
vscode "bruceyuhb.hsl-preview"
# Markdown 语法检查与格式化工具
vscode "davidanson.vscode-markdownlint"
# ESLint 代码规范检查插件
vscode "dbaeumer.vscode-eslint"
# GitLens 增强 Git 源码版本控制体验
vscode "eamodio.gitlens"
# EditorConfig 支持，统一不同编辑器的代码风格
vscode "editorconfig.editorconfig"
# Prettier 代码格式化工具
vscode "esbenp.prettier-vscode"
# uni-app 语法高亮与代码提示
vscode "evils.uniapp-vscode"
# GitHub 官方 VS Code 主题
vscode "github.github-vscode-theme"
# Google Gemini AI 编程助手
vscode "google.geminicodeassist"
# 在树状视图中显示 TODO 等待办注释
vscode "gruntfuggly.todo-tree"
# 强大的多语言 i18n 辅助插件
vscode "lokalise.i18n-ally"
# MarsCode AI 编程助手（豆包）
vscode "marscode.marscode-extension"
# .env 环境配置文件的语法高亮
vscode "mikestead.dotenv"
# VS Code 简体中文语言包
vscode "ms-ceintl.vscode-language-pack-zh-hans"
# ChatGPT 交互集成插件
vscode "openai.chatgpt"
# package.json 依赖包版本更新提示
vscode "pflannery.vscode-versionlens"
# YAML 语法高亮与校验支持
vscode "redhat.vscode-yaml"
# 源代码拼写检查工具
vscode "streetsidesoftware.code-spell-checker"
# Stylelint CSS/SCSS 代码审查与规范检查
vscode "stylelint.vscode-stylelint"
# 腾讯云 CODING AI 编程助手
vscode "tencent-cloud.coding-copilot"
# uni-app schema 校验支持
vscode "uni-helper.uni-app-schemas-vscode"
# uni-app 代码片段
vscode "uni-helper.uni-app-snippets-vscode"
# uni-app 开发辅助工具合集
vscode "uni-helper.uni-helper-vscode"
# uni-app 条件编译代码高亮
vscode "uni-helper.uni-highlight-vscode"
# uni-ui 组件代码片段
vscode "uni-helper.uni-ui-snippets-vscode"
# VS Code 文件图标主题
vscode "vscode-icons-team.vscode-icons"
# Vue 官方语言功能插件 (Volar)
vscode "vue.volar"
# CSS 变量自动补全与跳转
vscode "vunguyentuan.vscode-css-variables"
# 快速转换变量命名风格 (驼峰、下划线等)
vscode "wmaurer.change-case"
# Markdown 全能工具箱
vscode "yzhang.markdown-all-in-one"
# One Dark Pro 主题 (Material Theme)
vscode "zhuangtongfa.material-theme"